InformationRegisters/ГИГ_СрокиПоставкиНаСкладПоставщикаСПроизводства.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.10">
	<InformationRegister>
		<Properties>
			<Name>ГИГ_СрокиПоставкиНаСкладПоставщикаСПроизводства</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>СрокПоставки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Характеристика</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СкладПоставщика</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ГИГ_СкладыПоставщиков</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ГИГ_СрокиПоставкиНаСкладПоставщикаСПроизводства/Ext/ManagerModule.bsl
Функция СрокПоставкиНоменклатуры(СкладПоставщика,Номенклатура,Характеристика = Неопределено) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ГИГ_СрокиПоставкиНаСкладПоставщикаСПроизводства.СрокПоставки КАК СрокПоставки
	               |ИЗ
	               |	РегистрСведений.ГИГ_СрокиПоставкиНаСкладПоставщикаСПроизводства КАК ГИГ_СрокиПоставкиНаСкладПоставщикаСПроизводства
	               |ГДЕ
	               |	ГИГ_СрокиПоставкиНаСкладПоставщикаСПроизводства.Номенклатура = &Номенклатура
	               |	И ГИГ_СрокиПоставкиНаСкладПоставщикаСПроизводства.Характеристика = &Характеристика
	               |	И ГИГ_СрокиПоставкиНаСкладПоставщикаСПроизводства.СкладПоставщика = &СкладПоставщика";
	Запрос.УстановитьПараметр("СкладПоставщика",СкладПоставщика);
	Запрос.УстановитьПараметр("Номенклатура",Номенклатура);
	Запрос.УстановитьПараметр("Характеристика",?(ЗначениеЗаполнено(Характеристика),Характеристика,Справочники.ХарактеристикиНоменклатуры.ПустаяСсылка()));
	
	Результат = Запрос.Выполнить();
	
	Если Результат.Пустой() Тогда
		Возврат Неопределено;
	Иначе
		Сроки = Результат.Выгрузить()[0];
		
		СтруктураВозврат = Новый Структура("СрокПоставкиМин,СрокПоставкиМакс",Сроки.СрокПоставки,Сроки.СрокПоставки);
		
		Возврат СтруктураВозврат;
	КонецЕсли;	
	
	
КонецФункции
